package ru.Mvideo.testData;

import org.junit.jupiter.params.provider.Arguments;

import java.util.List;

public class TestDataForCatalog {
    public String catalogMenuElements = "Акции, скидки и распродажи\n" +
            "Смартфоны и гаджеты\n" +
            "Ноутбуки и компьютеры\n" +
            "Телевизоры и цифровое ТВ\n" +
            "Аудиотехника\n" +
            "Техника для кухни\n" +
            "Техника для дома\n" +
            "Красота и здоровье\n" +
            "Умный дом\n" +
            "Игры и софт\n" +
            "Хобби, спорт и развлечения\n" +
            "Электроинструменты и садовая техника\n" +
            "Фото и видео\n" +
            "Автоэлектроника\n" +
            "Аксессуары";
    public String salesElements = "Главные акции\n" +
            "Кэшбэк 20% на бытовую технику и ТВ\n" +
            "Скидки и рассрочка «0-0-24» на технику\n" +
            "Акция «Рассрочка»\n" +
            "Товары выходного дня\n" +
            "Экспресс-доставка за 2 часа в подарок при покупке от 9 990 Р\n" +
            "Все промокоды\n" +
            "Все акции\n" +
            "Распродажи\n" +
            "Скидки на стиральные машины\n" +
            "Не пропустите\n" +
            "iPhone 14 и 14 Pro\n" +
            "Artel – надёжная техника для дома и кухни\n" +
            "Рекомендуем\n" +
            "M.PRO Фото\n" +
            "Видеоконсультации онлайн\n" +
            "Статьи\n" +
            "Тестируем iPhone 14 Pro Max: эволюция с элементами революции\n" +
            "10 самых крутых фишек iOS 16\n" +
            "Как установить «Сбербанк Онлайн» и приложения других банков на iPhone\n" +
            "Когда будет Черная пятница в 2022 году\n" +
            "Prince of Persia, Max Payne и другие игры, где время идет не так, как мы привыкли\n" +
            "30+ идей, что подарить на День учителя";

    public String phonesElements = "Смартфоны, мобильные телефоны\n" +
            "Смартфоны\n" +
            "Apple iPhone\n" +
            "iPhone 14 | 14 Plus\n" +
            "iPhone 14 Pro | 14 Pro Max\n" +
            "Tecno\n" +
            "Samsung\n" +
            "Huawei\n" +
            "Кнопочные телефоны\n" +
            "Xiaomi\n" +
            "Смартфоны Xiaomi\n" +
            "Смарт-часы Xiaomi\n" +
            "Фитнес-браслеты Xiaomi\n" +
            "Чехлы для смартфонов Xiaomi\n" +
            "Наушники Xiaomi\n" +
            "Планшеты и электронные книги\n" +
            "Все планшеты\n" +
            "Apple iPad\n" +
            "Samsung Galaxy Tab\n" +
            "Huawei MatePad\n" +
            "Аксессуары для планшетов\n" +
            "Электронные книги и аксессуары\n" +
            "Гаджеты\n" +
            "Смарт-часы\n" +
            "Apple Watch\n" +
            "Apple Watch 8 | SE | Ultra\n" +
            "Фитнес-браслеты\n" +
            "Спортивные часы\n" +
            "Детские часы\n" +
            "Умные гаджеты\n" +
            "Товары для блогеров\n" +
            "Аксессуары для смартфонов\n" +
            "Чехлы\n" +
            "Стёкла и плёнки\n" +
            "Зарядные устройства\n" +
            "Кабели\n" +
            "Карты памяти\n" +
            "Держатели и попсокеты\n" +
            "Моноподы\n" +
            "Подставки для телефонов\n" +
            "Сопутствующие товары\n" +
            "Наушники\n" +
            "Портативное аудио\n" +
            "Внешние аккумуляторы\n" +
            "SIM-карты\n" +
            "Гарнитуры\n" +
            "Стабилизаторы и стедикамы\n" +
            "Очки виртуальной реальности\n" +
            "Геймпады для смартфонов";
    public String computerElements = "Ноутбуки\n" +
            "Все ноутбуки\n" +
            "Ноутбуки Apple\n" +
            "Ноутбуки Huawei\n" +
            "Игровые ноутбуки\n" +
            "Ноутбуки-трансформеры\n" +
            "Ультрабуки\n" +
            "Планшеты\n" +
            "Компьютеры и мониторы\n" +
            "Мониторы\n" +
            "Игровые мониторы\n" +
            "Мультимедийные проекторы\n" +
            "Системные блоки\n" +
            "Игровые системные блоки\n" +
            "Моноблоки\n" +
            "Компьютерные комплектующие\n" +
            "Жёсткие диски (HDD и SSD)\n" +
            "Видеокарты\n" +
            "Процессоры\n" +
            "Оперативная память\n" +
            "Материнские платы\n" +
            "Корпуса\n" +
            "Блоки питания\n" +
            "Прочие комплектующие\n" +
            "Периферийные устройства\n" +
            "МФУ\n" +
            "Принтеры\n" +
            "Картриджи\n" +
            "Сканеры\n" +
            "Компактные фотопринтеры\n" +
            "3D-ручки и 3D-принтеры\n" +
            "Бумага\n" +
            "Ламинаторы\n" +
            "Аксессуары\n" +
            "Игровые аксессуары\n" +
            "Клавиатуры и мыши\n" +
            "Роутеры и сетевое оборудование\n" +
            "Внешние жёсткие диски\n" +
            "Флеш-накопители\n" +
            "Сумки для ноутбуков\n" +
            "Компьютерная мебель\n" +
            "Антивирусы и программное обеспечение";
    public String tvElements = "Телевизоры\n" +
            "Все телевизоры\n" +
            "4K UHD-телевизоры\n" +
            "8K -телевизоры\n" +
            "Смарт-телевизоры\n" +
            "QLED-телевизоры\n" +
            "OLED-телевизоры\n" +
            "LG NanoCell телевизоры\n" +
            "Samsung интерьерные ТВ\n" +
            "По диагонали\n" +
            "12\" - 27\"\n" +
            "28\" - 38\"\n" +
            "39\" - 48\"\n" +
            "49\" - 54\"\n" +
            "55\" - 64\"\n" +
            "65\" - 74\"\n" +
            "75\" - 81\"\n" +
            "82\" и более\n" +
            "Цифровое/спутниковое ТВ\n" +
            "Триколор/НТВ+/МТС\n" +
            "Приставки Smart TV\n" +
            "Приставки Apple TV\n" +
            "IVI\n" +
            "OKKO\n" +
            "Megogo\n" +
            "Wink\n" +
            "Все онлайн кинотеатры\n" +
            "Проекторы и экраны\n" +
            "Мини проекторы\n" +
            "Мультимедийные проекторы\n" +
            "Экраны для видеопроекторов\n" +
            "Подвесы и подставки для видеопроекторов\n" +
            "Аксессуары\n" +
            "Кронштейны для TV\n" +
            "Кабели и переходники\n" +
            "Чистящие средства для экранов\n" +
            "Сетевые фильтры и удлиннители\n" +
            "Стабилизаторы напряжения\n" +
            "Антенны\n" +
            "Пульты для телевизоров\n" +
            "Фирменные рамки для телевизоров\n" +
            "Комплектующие\n" +
            "DVD, Blu-Ray и медиаплееры\n" +
            "Телевизионные приемники DVB-T2\n" +
            "Медиастримеры\n" +
            "Клавиатуры для Smart TV\n" +
            "Тумбы и подставки для телевизоров\n" +
            "Батарейки и аккумуляторы";
    public String audioTechniqueElements = "Портативное аудио\n" +
            "Портативные колонки\n" +
            "Умные колонки\n" +
            "MP3 плееры\n" +
            "iPod\n" +
            "Радио\n" +
            "Диктофоны\n" +
            "Магнитолы\n" +
            "Домашнее аудио и DJ\n" +
            "Саундбары\n" +
            "Домашние кинотеатры\n" +
            "Музыкальные центры\n" +
            "Товары для блогеров\n" +
            "DJ-контроллеры\n" +
            "DJ-наушники\n" +
            "Активные колонки для DJ\n" +
            "Трансляционное оборудование\n" +
            "Наушники\n" +
            "Все наушники\n" +
            "Наушники True Wireless\n" +
            "Наушники Bluetooth\n" +
            "Наушники проводные\n" +
            "Игровые наушники\n" +
            "Компьютерные наушники\n" +
            "Гарнитуры для телефонов\n" +
            "Усилители для наушников\n" +
            "Hi-Fi\n" +
            "Колонки Hi-Fi\n" +
            "Сабвуферы\n" +
            "Активная Hi-Fi акустика\n" +
            "Ресиверы Hi-Fi\n" +
            "Усилители Hi-Fi\n" +
            "Виниловые проигрыватели\n" +
            "Виниловые пластинки\n" +
            "CD плееры Hi-Fi\n" +
            "Автоакустика\n" +
            "Автомагнитолы\n" +
            "Колонки автомобильные\n" +
            "Сабвуферы\n" +
            "Усилители\n" +
            "Музыкальные инструменты и аксессуары\n" +
            "Синтезаторы\n" +
            "Ударные установки\n" +
            "Гитары\n" +
            "Укулеле\n" +
            "Аксессуары для музыкальных инструментов\n" +
            "Микрофоны\n" +
            "Подставки и подвесы для колонок\n" +
            "Кабели и аксессуары Hi-Fi";
    public String techniqueForKitchenElements = "Крупная кухонная техника\n" +
            "Холодильники и морозильные камеры\n" +
            "Холодильники Side-by-Side и многодверные\n" +
            "Морозильники\n" +
            "Винные шкафы\n" +
            "Плиты газовые\n" +
            "Плиты электрические\n" +
            "Посудомоечные машины\n" +
            "Кулеры для воды\n" +
            "Приготовление пищи\n" +
            "Микроволновые печи\n" +
            "Миксеры и блендеры\n" +
            "Мясорубки\n" +
            "Мультиварки\n" +
            "Электрогрили\n" +
            "Кухонные машины и комбайны\n" +
            "Мини-печи\n" +
            "Хлебопечки\n" +
            "Мелкая кухонная техника\n" +
            "Электрочайники\n" +
            "Тостеры и ростеры\n" +
            "Соковыжималки\n" +
            "Мультипекари\n" +
            "Сушки для фруктов\n" +
            "Кухонные весы\n" +
            "Электровафельницы\n" +
            "Вакуумные упаковщики и су-вид\n" +
            "Встраиваемая техника\n" +
            "Духовые шкафы\n" +
            "Панели газовые и электрические\n" +
            "Вытяжки\n" +
            "Встраиваемые посудомоечные машины\n" +
            "Холодильники и морозильники встраиваемые\n" +
            "Встраиваемые микроволновые печи\n" +
            "Стиральные машины встраиваемые\n" +
            "Прочая встраиваемая техника\n" +
            "Посуда и аксессуары\n" +
            "Наборы посуды\n" +
            "Сковороды\n" +
            "Кастрюли\n" +
            "Кухонные принадлежности\n" +
            "Ножи и столовые приборы\n" +
            "Аксессуары для посудомоечных машин\n" +
            "Аксессуары для кухонных плит\n" +
            "Прочие кухонные аксессуары\n" +
            "Приготовление кофе\n" +
            "Автоматические кофемашины\n" +
            "Кофемашины капсульного типа\n" +
            "Кофеварки\n" +
            "Кофеварки капсульного типа\n" +
            "Кофемолки\n" +
            "Капучинаторы\n" +
            "Кофе\n" +
            "Аксессуары для кофемашин";
    public String techniqueForHomeElements = "Климатическая техника\n" +
            "Кондиционеры\n" +
            "Вентиляторы\n" +
            "Водонагреватели\n" +
            "Увлажнители воздуха\n" +
            "Очистители воздуха\n" +
            "Конвекторы\n" +
            "Радиаторы\n" +
            "Тепловентиляторы\n" +
            "Пылесосы\n" +
            "Все пылесосы\n" +
            "Пылесосы с контейнером для пыли\n" +
            "Беспроводные с контейнером\n" +
            "Пылесосы вертикальные handstick\n" +
            "Роботы-пылесосы\n" +
            "Моющие пылесосы\n" +
            "Пылесосы с пылесборником\n" +
            "Пароочистители\n" +
            "Стиральные и сушильные машины\n" +
            "Стиральные машины\n" +
            "Узкие стиральные машины\n" +
            "Стиральные машины с сушкой\n" +
            "Сушильные машины\n" +
            "Стиральные машины встраиваемые\n" +
            "Cтиральные машины премиум\n" +
            "Компактные стиральные машины\n" +
            "Аксессуары для стиральных машин\n" +
            "Товары для ухода за одеждой\n" +
            "Утюги\n" +
            "Парогенераторы\n" +
            "Отпариватели\n" +
            "Швейные машины\n" +
            "Гладильные доски\n" +
            "Паровой шкаф для одежды\n" +
            "Паровые гладильные установки\n" +
            "Сушилки для белья\n" +
            "Товары для дома и сада\n" +
            "Электрические инструменты\n" +
            "Умный дом\n" +
            "IP-видеокамеры\n" +
            "Датчики безопасности\n" +
            "Охранные системы\n" +
            "Комплекты решений\n" +
            "Умный свет\n" +
            "Садовая техника\n" +
            "Аксессуары для дома\n" +
            "Освещение и LED-лампы\n" +
            "Батарейки и аккумуляторы\n" +
            "Сетевые фильтры и удлинители\n" +
            "Метеостанции и термометры\n" +
            "Аксессуары для пылесосов\n" +
            "Аксессуары для климатической техники";
}
